export const spks = {
  welcome: 'hi~我是抱抱，芳香教室专属助理，请问您是来体验课程、日常巡检还是进行聊天？',
  startSurveyTip: '好的，接下来请先选择需要体验的课程',
  chooseVideo: '请选择一个课程视频',
  chooseSurvey: '请选择一个试卷吧, 或者关闭',
  chooseCourse: '请选择需要体验的课程',
  videoPlaying: '正在播放课程视频',
  videoError: '视频播放失败',
  result: (label: string) => `测评完成，您的结果为：${label}`,
  course: '根据您的情况，给您推荐甜美风风格精油，请您找好位置坐好，准备开始我们的芳香之旅haha~',
  finishClass: '体验结束了, 调整至下课模式成功',
}

export const replys = {
  请问您是否坐好了: {
    是: '好的感谢配合现在请跟随系统指导进行体验课程，现在为您打开芳香机，播放轻缓音乐',
    否: '好的 我知道了',
  },
  进入聊天模式:
    '您好我是抱抱，是一位精通中文、英文、日语、葡萄牙语、西班牙语的虚拟客服，诞生于上海开放民生学院，今年十八岁。性格活泼开朗，热情洋溢的虚拟助理。接下来我们进行愉快的聊天。',
  体验课程: '好的接下来我带您体验一节芳香课程，请先选择需要体验的课程',
  课程列表: '请稍等，为您加载课程列表',
  播放音乐: '请稍后这就为您播放音乐',
}

export const asks = {
  fragrance1: '香薰模式1',
  下课: '下课模式',
}
